data/1-replicas/1-producers/1-consumers/10-throughput/2-trial/producer.txt
2018-11-23 22:35:26, 97622 records sent, 19524.4 records/sec (9.53 MB/sec), 5.4 ms avg latency, 272.0 max latency.
2018-11-23 22:35:31, 97671 records sent, 19534.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 25.0 max latency.
2018-11-23 22:35:37, 97714 records sent, 17103.8 records/sec (8.35 MB/sec), 1.6 ms avg latency, 713.0 max latency.
2018-11-23 22:35:42, 111619 records sent, 22319.3 records/sec (10.90 MB/sec), 88.1 ms avg latency, 715.0 max latency.
2018-11-23 22:35:47, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 19.0 max latency.
2018-11-23 22:35:52, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:35:57, 97714 records sent, 19538.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:36:02, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:36:07, 97717 records sent, 19543.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:36:12, 97632 records sent, 19526.4 records/sec (9.53 MB/sec), 1.5 ms avg latency, 6.0 max latency.
2018-11-23 22:36:17, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 374.5 ms avg latency, 1710.0 max latency.
2018-11-23 22:36:22, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:36:27, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:36:32, 97733 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:36:37, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 8.0 max latency.
2018-11-23 22:36:42, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:36:47, 97655 records sent, 19531.0 records/sec (9.54 MB/sec), 1.5 ms avg latency, 14.0 max latency.
2018-11-23 22:36:52, 97663 records sent, 19532.6 records/sec (9.54 MB/sec), 490.8 ms avg latency, 1944.0 max latency.
2018-11-23 22:36:57, 97717 records sent, 19543.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 13.0 max latency.
2018-11-23 22:37:02, 97664 records sent, 19532.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:37:07, 97702 records sent, 19532.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-23 22:37:12, 97701 records sent, 19536.3 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:37:17, 97667 records sent, 19533.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:37:22, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 9.0 max latency.
2018-11-23 22:37:27, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 18.0 max latency.
2018-11-23 22:37:32, 97703 records sent, 19536.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:37:37, 97694 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 9.0 max latency.
2018-11-23 22:37:42, 97730 records sent, 19546.0 records/sec (9.54 MB/sec), 440.4 ms avg latency, 1863.0 max latency.
2018-11-23 22:37:47, 97658 records sent, 19523.8 records/sec (9.53 MB/sec), 1.5 ms avg latency, 8.0 max latency.
2018-11-23 22:37:52, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 15.0 max latency.
2018-11-23 22:37:57, 97706 records sent, 19541.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:38:02, 97643 records sent, 19528.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 9.0 max latency.
2018-11-23 22:38:07, 97714 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:38:12, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 15.0 max latency.
2018-11-23 22:38:17, 57597 records sent, 11494.1 records/sec (5.61 MB/sec), 2.1 ms avg latency, 2064.0 max latency.
2018-11-23 22:38:22, 137956 records sent, 27585.7 records/sec (13.47 MB/sec), 387.2 ms avg latency, 2066.0 max latency.
2018-11-23 22:38:27, 97674 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:38:32, 97702 records sent, 19540.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:38:37, 97667 records sent, 19529.5 records/sec (9.54 MB/sec), 1.6 ms avg latency, 13.0 max latency.
2018-11-23 22:38:42, 97717 records sent, 19535.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:38:47, 97690 records sent, 19538.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 14.0 max latency.
2018-11-23 22:38:53, 74472 records sent, 12741.1 records/sec (6.22 MB/sec), 1.6 ms avg latency, 2035.0 max latency.
2018-11-23 22:38:58, 137394 records sent, 27478.8 records/sec (13.42 MB/sec), 368.2 ms avg latency, 2036.0 max latency.
2018-11-23 22:39:03, 97701 records sent, 19532.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:39:08, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:39:13, 97644 records sent, 19528.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:39:18, 97694 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:39:23, 97713 records sent, 19534.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 12.0 max latency.
2018-11-23 22:39:28, 73242 records sent, 13158.8 records/sec (6.43 MB/sec), 1.6 ms avg latency, 1819.0 max latency.
2018-11-23 22:39:33, 133193 records sent, 26638.6 records/sec (13.01 MB/sec), 403.2 ms avg latency, 2002.0 max latency.
2018-11-23 22:39:38, 97663 records sent, 19528.7 records/sec (9.54 MB/sec), 1.6 ms avg latency, 7.0 max latency.
2018-11-23 22:39:43, 97694 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:39:48, 97703 records sent, 19540.6 records/sec (9.54 MB/sec), 1.6 ms avg latency, 16.0 max latency.
2018-11-23 22:39:53, 97666 records sent, 19533.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:39:58, 97694 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:40:04, 79686 records sent, 13241.3 records/sec (6.47 MB/sec), 1.6 ms avg latency, 1940.0 max latency.
2018-11-23 22:40:09, 135545 records sent, 27109.0 records/sec (13.24 MB/sec), 373.5 ms avg latency, 1942.0 max latency.
2018-11-23 22:40:14, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 6.0 max latency.
2018-11-23 22:40:19, 97695 records sent, 19535.1 records/sec (9.54 MB/sec), 1.6 ms avg latency, 4.0 max latency.
2018-11-23 22:40:24, 97694 records sent, 19538.8 records/sec (9.54 MB/sec), 1.6 ms avg latency, 5.0 max latency.
2018-11-23 22:40:29, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.7 ms avg latency, 37.0 max latency.
2018-11-23 22:40:34, 97663 records sent, 19524.8 records/sec (9.53 MB/sec), 5.7 ms avg latency, 174.0 max latency.
2018-11-23 22:40:39, 97694 records sent, 19534.9 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-23 22:40:44, 97675 records sent, 19535.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 3.0 max latency.
2018-11-23 22:40:49, 97697 records sent, 19539.4 records/sec (9.54 MB/sec), 1.6 ms avg latency, 17.0 max latency.
2018-11-23 22:40:54, 97640 records sent, 19524.1 records/sec (9.53 MB/sec), 1.6 ms avg latency, 10.0 max latency.
2018-11-23 22:40:59, 97686 records sent, 19537.2 records/sec (9.54 MB/sec), 1.6 ms avg latency, 2.0 max latency.
2018-11-23 22:41:04, 97694 records sent, 19531.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 5.0 max latency.
2018-11-23 22:41:10, 88585 records sent, 15503.2 records/sec (7.57 MB/sec), 1.7 ms avg latency, 1182.0 max latency.
2018-11-23 22:41:15, 120710 records sent, 24137.2 records/sec (11.79 MB/sec), 419.3 ms avg latency, 1952.0 max latency.
2018-11-23 22:41:20, 97705 records sent, 19541.0 records/sec (9.54 MB/sec), 1.6 ms avg latency, 9.0 max latency.
2018-11-23 22:41:21, 7031250 records sent, 19529.839512 records/sec (9.54 MB/sec), 57.83 ms avg latency, 2066.00 ms max latency, 2 ms 50th, 298 ms 95th, 1598 ms 99th, 1947 ms 99.9th.